In [29]:
import pandas as pd
import pandasql as psql

In [30]:
dataset= 'Corona Virus Dataset.csv'
df = pd.read_csv(dataset)
df

,Province,Country/Region,Latitude,Longitude,Date,Confirmed,Deaths,Recovered
0,Afghanistan,Afghanistan,33.939110,67.709953,22-01-2020,0,0,0
1,Afghanistan,Afghanistan,33.939110,67.709953,23-01-2020,0,0,0
2,Afghanistan,Afghanistan,33.939110,67.709953,24-01-2020,0,0,0
3,Afghanistan,Afghanistan,33.939110,67.709953,25-01-2020,0,0,0
4,Afghanistan,Afghanistan,33.939110,67.709953,26-01-2020,0,0,0
...,...,...,...,...,...,...,...,...
78381,Zimbabwe,Zimbabwe,-19.015438,29.154857,09-06-2021,111,5,161
78382,Zimbabwe,Zimbabwe,-19.015438,29.154857,10-06-2021,64,4,23
78383,Zimbabwe,Zimbabwe,-19.015438,29.154857,11-06-2021,192,3,30
78384,Zimbabwe,Zimbabwe,-19.015438,29.154857,12-06-2021,164,3,22
78385,Zimbabwe,Zimbabwe,-19.015438,29.154857,13-06-2021,107,0,12

In [31]:
df['Date'] = pd.to_datetime(df['Date'], format='%d-%m-%Y')
df['Date']

0       2020-01-22
1       2020-01-23
2       2020-01-24
3       2020-01-25
4       2020-01-26
           ...
78381   2021-06-09
78382   2021-06-10
78383   2021-06-11
78384   2021-06-12
78385   2021-06-13
Name: Date, Length: 78386, dtype: datetime64[ns]

In [32]:
def run_query(query, df):
    return psql.sqldf(query, locals())

## Q1. Write a code to check NULL values

In [33]:
query_q1 = """
SELECT 
    SUM(CASE WHEN Province IS NULL THEN 1 ELSE 0 END) AS Province_nulls,
    SUM(CASE WHEN `Country/Region` IS NULL THEN 1 ELSE 0 END) AS Country_Region_nulls,
    SUM(CASE WHEN Latitude IS NULL THEN 1 ELSE 0 END) AS Latitude_nulls,
    SUM(CASE WHEN Longitude IS NULL THEN 1 ELSE 0 END) AS Longitude_nulls,
    SUM(CASE WHEN Date IS NULL THEN 1 ELSE 0 END) AS Date_nulls,
    SUM(CASE WHEN Confirmed IS NULL THEN 1 ELSE 0 END) AS Confirmed_nulls,
    SUM(CASE WHEN Deaths IS NULL THEN 1 ELSE 0 END) AS Deaths_nulls,
    SUM(CASE WHEN Recovered IS NULL THEN 1 ELSE 0 END) AS Recovered_nulls
FROM df
"""
result_q1 = run_query(query_q1, df)
result_q1

,Province_nulls,Country_Region_nulls,Latitude_nulls,Longitude_nulls,Date_nulls,Confirmed_nulls,Deaths_nulls,Recovered_nulls
0,0,0,0,0,0,0,0,0

## Q2. If NULL values are present, update them with zeros for all columns.

In [34]:
# Based on the results of the first query, we know that there are no NULL values in any of the columns in the dataset. 
# Therefore, there is no need to execute query number 2, which would replace NULL values with zeroes.

## Q3. check total number of rows

In [35]:
query_q3 = "SELECT COUNT(*) AS total_rows FROM df"
result_q3 = run_query(query_q3, df)
result_q3

   total_rows
0       78386

## Q4. Check what is start_date and end_date

In [36]:
query_q4 = "SELECT MIN(Date) AS start_date, MAX(Date) AS end_date FROM df"
result_q4 = run_query(query_q4, df)
result_q4

                   start_date                    end_date
0  2020-01-22 00:00:00.000000  2021-06-13 00:00:00.000000

## Q5. Number of month present in dataset

In [37]:
query_q5 = "SELECT COUNT(DISTINCT strftime('%Y-%m', Date)) AS num_months FROM df"
result_q5 = run_query(query_q5, df)
result_q5

   num_months
0          18

## Q6. Find monthly average for confirmed, deaths, recovered

In [38]:
query_q6 = """
SELECT 
    strftime('%Y-%m', Date) AS month,
    AVG(Confirmed) AS avg_confirmed,
    AVG(Deaths) AS avg_deaths,
    AVG(Recovered) AS avg_recovered
FROM df
GROUP BY month
"""
result_q6 = run_query(query_q6, df)
result_q6

      month  avg_confirmed  avg_deaths  avg_recovered
0   2020-01       4.145455    0.123377       0.092857
1   2020-02      15.296014    0.593596       7.032020
2   2020-03     161.130289    8.660662      27.873900
3   2020-04     505.800433   41.522294     171.642208
4   2020-05     574.849811   30.280897     318.296397
5   2020-06     859.228139   29.817532     548.791558
6   2020-07    1432.361123   35.109552     983.058232
7   2020-08    1611.842899   37.536657    1299.294721
8   2020-09    1784.587446   34.777273    1438.906710
9   2020-10    2412.199623   36.758274    1420.643067
10  2020-11    3592.194372   56.763420    1985.344589
11  2020-12    4050.439673   71.218266    2497.885002
12  2021-01    3911.228530   84.183703    1919.636992
13  2021-02    2433.363636   69.164889    1558.391698
14  2021-03    2916.797235   59.199832    1652.285924
15  2021-04    4699.355195   78.438745    3074.785065
16  2021-05    4005.254085   76.780268    4007.507750
17  2021-06    2508.632368   66.262238    2769.449550

## Q7: Most frequent value for confirmed, deaths, recovered each month

In [39]:
query_q7 = """
SELECT 
    month,
    Confirmed,
    Deaths,
    Recovered
FROM (
    SELECT 
        strftime('%Y-%m', Date) AS month,
        Confirmed,
        Deaths,
        Recovered,
        ROW_NUMBER() OVER (PARTITION BY strftime('%Y-%m', Date) ORDER BY COUNT(*) DESC) AS r
    FROM df
    GROUP BY month, Confirmed, Deaths, Recovered
) t
WHERE r = 1
"""
result_q7 = run_query(query_q7, df)
result_q7

      month  Confirmed  Deaths  Recovered
0   2020-01          0       0          0
1   2020-02          0       0          0
2   2020-03          0       0          0
3   2020-04          0       0          0
4   2020-05          0       0          0
5   2020-06          0       0          0
6   2020-07          0       0          0
7   2020-08          0       0          0
8   2020-09          0       0          0
9   2020-10          0       0          0
10  2020-11          0       0          0
11  2020-12          0       0          0
12  2021-01          0       0          0
13  2021-02          0       0          0
14  2021-03          0       0          0
15  2021-04          0       0          0
16  2021-05          0       0          0
17  2021-06          0       0          0

## Q8. Find minimum values for confirmed, deaths, recovered per year

In [40]:
query_q8 = """
SELECT 
    strftime('%Y', Date) AS year,
    MIN(Confirmed) AS min_confirmed,
    MIN(Deaths) AS min_deaths,
    MIN(Recovered) AS min_recovered
FROM df
GROUP BY year
"""
result_q8 = run_query(query_q8, df)
result_q8

   year  min_confirmed  min_deaths  min_recovered
0  2020              0           0              0
1  2021              0           0              0

## Q9. Find maximum values of confirmed, deaths, recovered per year

In [41]:
query_q9 = """
SELECT 
    strftime('%Y', Date) AS year,
    MAX(Confirmed) AS max_confirmed,
    MAX(Deaths) AS max_deaths,
    MAX(Recovered) AS max_recovered
FROM df
GROUP BY year
"""
result_q9 = run_query(query_q9, df)
result_q9

   year  max_confirmed  max_deaths  max_recovered
0  2020         823225        3752        1123456
1  2021         414188        7374         422436

## Q10. The total number of case of confirmed, deaths, recovered each month

In [42]:
query_q10 = """
SELECT 
    strftime('%Y-%m', Date) AS month,
    SUM(Confirmed) AS total_confirmed,
    SUM(Deaths) AS total_deaths,
    SUM(Recovered) AS total_recovered
FROM df
GROUP BY month
"""
result_q10 = run_query(query_q10, df)
result_q10

      month  total_confirmed  total_deaths  total_recovered
0   2020-01             6384           190              143
1   2020-02            68312          2651            31405
2   2020-03           769236         41346           133070
3   2020-04          2336798        191833           792987
4   2020-05          2744333        144561          1519547
5   2020-06          3969634        137757          2535417
6   2020-07          6838092        167613          4693120
7   2020-08          7694938        179200          6202833
8   2020-09          8244794        160671          6647749
9   2020-10         11515841        175484          6782150
10  2020-11         16595938        262247          9172292
11  2020-12         19336799        339996         11924903
12  2021-01         18672205        401893          9164347
13  2021-02         10492664        298239          6719785
14  2021-03         13924790        282620          7888013
15  2021-04         21711021        362387         14205507
16  2021-05         19121083        366549         19131842
17  2021-06          5022282        132657          5544438

## Q11. Check how corona virus spread out with respect to confirmed case##  (Eg.: total confirmed cases, their average, variance & STDEV )

In [43]:
query_q11 = """
SELECT 
    SUM(Confirmed) AS total_confirmed,
    AVG(Confirmed) AS avg_confirmed,
    SUM((Confirmed - (SELECT AVG(Confirmed) FROM df)) * (Confirmed - (SELECT AVG(Confirmed) FROM df))) / COUNT(*) AS variance_confirmed,
    SQRT(SUM((Confirmed - (SELECT AVG(Confirmed) FROM df)) * (Confirmed - (SELECT AVG(Confirmed) FROM df))) / COUNT(*)) AS stddev_confirmed
FROM df
"""
result_q11 = run_query(query_q11, df)
result_q11

   total_confirmed  avg_confirmed  variance_confirmed  stddev_confirmed
0        169065144    2156.828311        1.572889e+08      12541.488152

## Q12. Check how corona virus spread out with respect to death case per month##  (Eg.: total confirmed cases, their average, variance & STDEV )

In [44]:
query_q12 = """
SELECT 
    strftime('%Y-%m', Date) AS month,
    SUM(Deaths) AS total_deaths,
    AVG(Deaths) AS avg_deaths,
    AVG(Deaths * Deaths) - AVG(Deaths) * AVG(Deaths) AS variance_deaths,
    SQRT(AVG(Deaths * Deaths) - AVG(Deaths) * AVG(Deaths)) AS stddev_deaths
FROM df
GROUP BY strftime('%Y-%m', Date)
"""

result_q12 = run_query(query_q12, df)
result_q12

      month  total_deaths  avg_deaths  variance_deaths  stddev_deaths
0   2020-01           190    0.123377         4.245817       2.060538
1   2020-02          2651    0.593596        68.321849       8.265703
2   2020-03         41346    8.660662      3900.792265      62.456323
3   2020-04        191833   41.522294     40504.268118     201.256722
4   2020-05        144561   30.280897     20684.911671     143.822501
5   2020-06        137757   29.817532     16929.445710     130.113203
6   2020-07        167613   35.109552     21140.154944     145.396544
7   2020-08        179200   37.536657     23272.996457     152.554897
8   2020-09        160671   34.777273     20102.769224     141.784235
9   2020-10        175484   36.758274     17580.071020     132.589860
10  2020-11        262247   56.763420     27773.793597     166.654714
11  2020-12        339996   71.218266     65345.369201     255.627403
12  2021-01        401893   84.183703    102758.432319     320.559561
13  2021-02        298239   69.164889     68478.871467     261.684679
14  2021-03        282620   59.199832     54385.969703     233.207997
15  2021-04        362387   78.438745     94611.470923     307.589777
16  2021-05        366549   76.780268    131769.469313     363.000646
17  2021-06        132657   66.262238    112963.672990     336.100689

## Q13. Check how corona virus spread out with respect to recovered case##  (Eg.: total confirmed cases, their average, variance & STDEV )

In [45]:
query_q13 = """
SELECT 
    SUM(Recovered) AS total_recovered,
    AVG(Recovered) AS avg_recovered,
    SUM((Recovered - (SELECT AVG(Recovered) FROM df)) * (Recovered - (SELECT AVG(Recovered) FROM df))) / COUNT(*) AS variance_recovered,
    SQRT(SUM((Recovered - (SELECT AVG(Recovered) FROM df)) * (Recovered - (SELECT AVG(Recovered) FROM df))) / COUNT(*)) AS stddev_recovered
FROM df
"""
result_q13 = run_query(query_q13, df)
result_q13

   total_recovered  avg_recovered  variance_recovered  stddev_recovered
0        113089548    1442.726354        1.070295e+08      10345.507395

## Q14. Find Country having highest number of the Confirmed case

In [46]:
query_q14 = """
SELECT `Country/Region` 
FROM df
GROUP BY `Country/Region`
ORDER BY SUM(Confirmed) DESC
LIMIT 1
"""
result_q14 = run_query(query_q14, df)
result_q14

  Country/Region
0             US

## Q15. Find Country having lowest number of the death case

In [47]:
query_q15 = """
SELECT `Country/Region`
FROM df
GROUP BY `Country/Region`
ORDER BY SUM(Deaths)
LIMIT 1
"""
result_q15 = run_query(query_q15, df)
result_q15

  Country/Region
0       Dominica

##  Q16. Find top 5 countries having highest recovered case

In [48]:
query_q16 = """
SELECT `Country/Region`, SUM(Recovered) AS total_recovered
FROM df
GROUP BY `Country/Region`
ORDER BY total_recovered DESC
LIMIT 5
"""
result_q16 = run_query(query_q16, df)
result_q16

  Country/Region  total_recovered
0          India         28089649
1         Brazil         15400169
2             US          6303715
3         Turkey          5202251
4         Russia          4745756